app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 20 Jan 2014 03:37:24 UTC +00:00], ["description", "desc"], ["name", "name"], ["updated_at", Mon, 20 Jan 2014 03:37:24 UTC +00:00]]
---
  def create
    @event = Event.new(params[:event].permit(:name, :description, :date, :time, :npc, :location))

    if @event.save

SELECT "events".* FROM "events"
---
  def index
    @event = Event.all